Revit 2027 API
TextNode.GetFormattedText Method
 Returns an FormattedText object that contains text and associated formatting of this TextNode.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public FormattedText GetFormattedText()
Public Function GetFormattedText As FormattedText
public:
FormattedText^ GetFormattedText()
member GetFormattedText : unit -> FormattedText
Return Value
FormattedText
 The object that contains the text and associated formatting of of the text in this text note.
See Also
Reference
TextNode Class
Autodesk.Revit.DB Namespace